'use client';

import type React from 'react';
import { useState } from 'react';
import Image from 'next/image';
import styles from './LiposuctionPreparation.module.css';

interface LiposuctionPreparationProps {
  backgroundColor?: string;
}

interface ExpandableTextProps {
  title: string;
  text: string;
}

const ExpandableText: React.FC<ExpandableTextProps> = ({ title, text }) => {
  const [isExpanded, setIsExpanded] = useState(false);

  return (
    <div className={styles.expandableText}>
      <h3>{title}</h3>
      <p>{isExpanded ? text : `${text.slice(0, 100)}...`}</p>
      <button onClick={() => setIsExpanded(!isExpanded)}>
        {isExpanded ? 'Показати менше' : 'Показати більше'}
      </button>
    </div>
  );
};

const LiposuctionPreparation: React.FC<LiposuctionPreparationProps> = ({
  backgroundColor = '#f5f5f5',
}) => {
  return (
    <div className={styles.wrapper} style={{ backgroundColor }}>
      <div className={styles.container}>
        <h2 className={styles.title}>Консультація перед ліпосакцією</h2>
        <p className={styles.text}>
          Чи рекомендована операція у конкретному індивідуальному випадку? На це
          запитання відповість пластичний хірург на персональній консультації в
          клініці Vidnova.
        </p>
        <p className={styles.text}>
          Фахівець має 30-ти річний досвід у естетичній хірургії.
        </p>

        <div className={styles.contentWrapper}>
          <div className={styles.textContent}>
            <h2 className={styles.sectionTitle}>Процес проведення операції</h2>
            <ExpandableText
              title="Ліпосакція: підготовка до операції"
              text="Методика зменшення жирових відкладень відрізняється малоінвазивністю. Хороший стан здоров'я пацієнта є необхідною умовою проведення операції. За 2 тижні до призначеної дати рекомендується відмовитися від вживання алкоголю, тютюнопаління або максимально скоротити кількість сигарет, що викурюються. Перед операцією пацієнту необхідно пройти швидке обстеження та здати аналізи у клініці Vidnova. На підставі отриманих результатів пластичний хірург Світлана Работенко приймає рішення про проведення втручання."
            />
            <ExpandableText
              title="Ліпосакція: проведення операції"
              text="У клініці Vidnova застосовується найбільш ефективний та популярний метод відсмоктування жирових клітин – вакуумний. Підшкірні відкладення розріджуються та виводяться через тонкі (4-5 мм) порожнисті канюлі за допомогою вакууму. Пластичний хірург повністю контролює цей процес. Мікропроколи розташовуються у складках шкіри, тому їх практично не видно. Травматизація мінімальна. Шви не накладаються! Методика має на увазі вплив саме на жирові клітини, за рахунок чого відбувається зниження жирового обсягу. Інші техніки припускають втрату не клітин, а жиру. Зробити ліпосакцію можна, застосовуючи як місцеву анестезію, і загальний інгаляційний наркоз. Вона може застосовуватися як самостійна процедура, так і в поєднанні з іншими операціями, такими як збільшення молочних залоз, ліпофілінг грудей. Останнім часом дуже популярно ліпоскульптурування сідниць – коли поєднуються видалення жирових відкладень та ліпофілінг сідниць (пересадка власного жиру пацієнта). Естетичний результат операції залежить від якості шкіри пацієнта. Якщо шкірний покрив еластичний, пружний, без розтяжок, він чудово скорочується і не провисає. Це забезпечить високий результат ліпосакції. Якщо стан шкіри змінено, рекомендується виконання підтяжки."
            />
            <ExpandableText
              title="Ліпосакція: реабілітація після операції"
              text="У багатьох випадках ліпосакція проводиться під місцевою анестезією. При застосуванні місцевої анестезії пацієнт перебуває у свідомості, але нічого не відчуває. Передбачається амбулаторне проведення, коли госпіталізація не потрібна. Через 1 годину пацієнт їде додому із рекомендаціями від пластичного хірурга. Якщо хірургічне втручання проводилося під загальним наркозом, людина виписується з клініки через 1 добу. Перші дні пацієнт може відчувати оніміння в прооперованій зоні, присутні набряклість, синці. Дискомфортні відчуття усувають знеболювальні препарати. Чутливість шкіри повністю відновлюється за кілька тижнів. Важливий нюанс – ліпосакція живота та стегон передбачає носіння спеціальної компресійної білизни протягом 2-3 тижнів. Через 2 місяці можна поступово повертатися до фізичних навантажень, відвідувати сауни, басейни. Результат піддається об'єктивній оцінці вже за 1 місяць. Він стабільний і довготривалий, на відміну від звичайних способів схуднення. Жирова тканина після видалення не відновлюється, то повторне відкладення жиру у цих місцях неможливе. Проте варто дотримуватися режиму харчування та займатися спортом, щоб жир не накопичився в інших місцях."
            />
          </div>
          <div className={styles.imageContent}>
            <Image
              src="/images/liposuction/liposuction10.jpg"
              alt="Підготовка до ліпосакції"
              width={400}
              height={600}
              layout="responsive"
            />

            <Image
              src="/images/liposuction/liposuction11.jpg"
              alt="Підготовка до ліпосакції"
              width={400}
              height={600}
              layout="responsive"
            />
          </div>
        </div>
      </div>
    </div>
  );
};

export default LiposuctionPreparation;
